CSI API ETABS v1

# cAreaObjSetModifiers Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetModifiers(
    	string Name,
    	ref double[] Value,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetModifiers (
    	Name As String,
    	ByRef Value As Double(),
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim Value As Double()
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetModifiers(Name,
    	Value, ItemType)

    int SetModifiers(
    	String^ Name,
    	array<double>^% Value,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetModifiers :
            Name : string *
            Value : float[] byref *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

Value

    Type: SystemDouble

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com